app/controllers/events_controller.rb

SELECT * FROM "events" WHERE (date > '2011-02-19') ORDER BY date desc
---
  def index

    @events = Event.find_all_events

SELECT * FROM "events" WHERE ("events"."id" = 0)
---
  def show
    @event = Event.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def new
    @event = Event.new
    @event.user = User.find(params[:user_id])

SELECT * FROM "events" WHERE ("events"."id" = 13)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def edit
    @event = Event.find(params[:id])
    @event.user = User.find(params[:user_id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
INSERT INTO "events" ("web_page_link", "price", "poster_updated_at", "address", "created_at", "title", "updated_at", "contact", "date", "lng", "user_id", "number_of_hits", "poster_content_type", "poster_file_size", "video_link", "poster_file_name", "description", "lat", "image_link") VALUES('http://www.google.com', NULL, '2011-02-19 22:46:24', '2123 shady avenue, squirrel hill, pittsburgh, pa 15217', '2011-02-19 22:46:26', 'Event1', '2011-02-19 22:46:26', '4082033048', '2011-02-24 17:05:00', -79.918155, 1, NULL, 'image/png', 6646, '', 'rails.png', '', 40.433926, 'u')
---
  def create
    @event = Event.new(params[:event])
    @event.user = User.find(params[:user_id])
    if(params[:poster]=='l')
      @event.poster = open(@event.image_link)
    else
      if(params[:poster]=='u')
        @event.image_link ='u'
      end
    end
    respond_to do |format|
      if @event.save

SELECT * FROM "events" WHERE ("events"."id" = 3)
UPDATE "events" SET "poster_content_type" = 'image/png', "updated_at" = '2011-02-19 23:43:31', "poster_file_size" = 107155, "poster_updated_at" = '2011-02-19 23:43:29', "poster_file_name" = 'open-uri20110219-5736-1i7q70d-0' WHERE "id" = 1
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])

SELECT * FROM "events" WHERE (date > '2011-02-15') ORDER BY date desc
---
  def show_all_events
    @events = Event.find_all_events

SELECT * FROM "events" WHERE (date > '2011-02-19' and user_id == '1') ORDER BY date desc
---
    def show_user_events
    @events = Event.find_user_events(params[:id])