app/controllers/event_registrations_controller.rb

  def index
    @event_registrations = EventRegistration.all
---
SELECT * FROM "event_registrations"

  def show
    @event_registration = EventRegistration.find(params[:id])
---
SELECT * FROM "event_registrations" WHERE ("event_registrations"."id" = 1)

  def create
    @event_registration = EventRegistration.new(params[:event_registration])

    respond_to do |format|
      if @event_registration.save
---
INSERT INTO "event_registrations" ("created_at", "event_id", "application_id", "updated_at") VALUES('2011-02-18 22:05:02', NULL, 123, '2011-02-18 22:05:02')

  def destroy
    @event_registration = EventRegistration.find(params[:id])
    @event_registration.destroy
---
SELECT * FROM "event_registrations" WHERE ("event_registrations"."id" = 1)
DELETE FROM "event_registrations" WHERE "id" = 1