app/controllers/events_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def index

    @events = User.find(params[:user_id])